[
{"name":"Prize Ticket","location":"Spinda's Cafe"},
{"name":"Silver Ticket","location":"Spinda's Cafe (After reaching Diamond Rank)"},
{"name":"Gold Ticket","location":"Spinda's Cafe (After reaching Super Rank)"},
{"name":"Prism Ticket","location":"Spinda's Cafe (After reaching Hyper Rank)"},
{"name":"Miracle Chest","location":"Zero Isle South 96F, Spinda's Cafe (Prism Ticket)"},
{"name":"IQ Booster","location":"Inferno Cave 30F, Spinda's Cafe (Prism Ticket)"},
{"name":"Nectar","location":"Any Box obtained from Combee with Nectar Bow. Spinda's Cafe (Silver, Gold, Prism Ticket)"},
{"name":"Wonder Gummi","location":"Zero Isle North 75F, Spinda's Cafe (Gold, Prism Ticket)"},
{"name":"Golden Mask","location":"Zero Isle North 75F"},
{"name":"Wonder Chest","location":"Zero Isle North 75F"},

{"name":"Beauty Scarf","location":"★5+ Job Reward"},
{"name":"Lunar Ribbon","location":"★5+ Job Reward"},
{"name":"Sun Ribbon","location":"★5+ Job Reward"},

{"name":"King's Rock","location":"★3+ Job Reward"},
{"name":"Deepseatooth","location":"★3+ Job Reward"},
{"name":"Moon Stone","location":"★3+ Job Reward"},
{"name":"Metal Coat","location":"★3+ Job Reward"},
{"name":"Link Cable","location":"★3+ Job Reward"},
{"name":"Protector","location":"★3+ Job Reward"},
{"name":"Razor Claw","location":"★3+ Job Reward"},
{"name":"Oval Stone","location":"★3+ Job Reward"},
{"name":"Shiny Stone","location":"★3+ Job Reward"},
{"name":"Mossy Rock","location":"★3+ Job Reward"},
{"name":"Leaf Stone","location":"★3+ Job Reward"},
{"name":"Dragon Scale","location":"★3+ Job Reward"},
{"name":"Upgrade","location":"★3+ Job Reward"},
{"name":"Dubious Disc","location":"★3+ Job Reward"},
{"name":"Sun Stone","location":"★3+ Job Reward"},
{"name":"Reaper Cloth","location":"★3+ Job Reward"},
{"name":"Razor Fang","location":"★3+ Job Reward"},
{"name":"Thunderstone","location":"★3+ Job Reward"},
{"name":"Electirizer","location":"★3+ Job Reward"},
{"name":"Magmarizer","location":"★3+ Job Reward"},
{"name":"Fire Stone","location":"★3+ Job Reward"},
{"name":"Dawn Stone","location":"★3+ Job Reward"},
{"name":"Water Stone","location":"★3+ Job Reward"},
{"name":"Dusk Stone","location":"★3+ Job Reward"},
{"name":"Coronet Rock","location":"★3+ Job Reward"},
{"name":"Deepseascale","location":"★3+ Job Reward"},
{"name":"Frozen Rock","location":"★3+ Job Reward"},


{"name":"Aerial Ace","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"All-Hit Orb","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"All-Mach Orb","location":"Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Shaymin Village (Station Passes, Sky Peak), Lake Afar, Dojo: Last Maze, Zero Isle East, Zero Isle West, Destiny Tower, Star Cave"},
{"name":"Apple","location":"Drenched Bluff, Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Oran Forest, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Lost Wilderness, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Sky Stairway, Mystery Jungle"},
{"name":"Aqua-Monica","location":"Bottomless Sea"},
{"name":"Attract","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Avalanche","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Big Apple","location":"Apple Woods, Amp Plains, Far Amp Plains, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Surrounded Sea, Marine Resort, Lake Afar, Mt. Mistral, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Star Cave"},
{"name":"Black Gummi","location":"Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle West, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Blast Seed","location":"Beach Cave, Drenched Bluff, Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Concealed Ruins, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Blinker Seed","location":"Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Mt. Travail, The Nightmare, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, Sky Stairway, Mystery Jungle"},
{"name":"Blizzard","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Blowback Orb","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Blue Gummi","location":"Drenched Bluff, Mt. Bristle, Waterfall Cave, Apple Woods, Craggy Coast, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle West, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Bounce Band","location":"Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower"},
{"name":"Brick Break","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Brine","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Brown Gummi","location":"Craggy Coast, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle West, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Shimmer Desert"},
{"name":"Bulk Up","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Bullet Seed","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Calcium","location":"Shaymin Village (Station Passes, Sky Peak), Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Star Cave"},
{"name":"Calm Mind","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Captivate","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Charge Beam","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Cheri Berry","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Mt. Travail, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Chesto Berry","location":"Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Surrounded Sea, Miracle Sea, Deep Miracle Sea, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Sky Stairway, Mystery Jungle"},
{"name":"Cleanse Orb","location":"Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Clear Gummi","location":"Waterfall Cave, Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle West, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Coronet Rock","location":"Labyrinth Cave"},
{"name":"Curve Band","location":"Blizzard Island, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Giant Volcano, World Abyss, Sky Stairway"},
{"name":"Cut","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle, Spinda's Cafe (Silver, Gold Ticket)"},
{"name":"Dark Pulse","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Dawn Stone","location":"Labyrinth Cave"},
{"name":"Decoy Orb","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Deepseascale","location":"Labyrinth Cave"},
{"name":"Deepseatooth","location":"Labyrinth Cave"},
{"name":"Def. Scarf","location":"Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Lost Wilderness, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Star Cave, Bottomless Sea, Mt. Avalanche, Mystery Jungle"},
{"name":"Defog","location":"Dojo: Last Maze, Destiny Tower, Spinda's Cafe (Silver, Gold Ticket)"},
{"name":"Detect Band","location":"Mystifying Forest, Blizzard Island, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Lost Wilderness, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Giant Volcano, World Abyss, Sky Stairway"},
{"name":"Diet Ribbon","location":"Zero Isle West, Destiny Tower"},
{"name":"Dig","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Dive","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Dodge Scarf","location":"Zero Isle West, Zero Isle South, Destiny Tower"},
{"name":"Doom Seed","location":"Mystifying Forest, Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Mt. Travail, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Mt. Mistral, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle Center, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Dough Seed","location":"Drenched Bluff, Mt. Bristle, Waterfall Cave, Apple Woods, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Mt. Travail, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Dragon Claw","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Dragon Pulse","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Dragon Scale","location":"Labyrinth Cave"},
{"name":"Drain Punch","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Dream Eater","location":"Dojo: Last Maze, Destiny Tower"},
{"name":"Dropeye Seed","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Mt. Travail, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Drought Orb","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Labyrinth Cave, Concealed Ruins, Marine Resort, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Dubious Disc","location":"Labyrinth Cave"},
{"name":"Dusk Stone","location":"Labyrinth Cave"},
{"name":"Earthquake","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Electirizer","location":"Labyrinth Cave"},
{"name":"Embargo","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Endure","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Energy Ball","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Escape Orb","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Marowak Dojo, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Evasion Orb","location":"Crystal Cave, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Explosion","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Eyedrop Seed","location":"Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Surrounded Sea, Miracle Sea, Deep Miracle Sea, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Mystery Jungle"},
{"name":"Facade","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"False Swipe","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle West, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Fiery Drum","location":"Giant Volcano"},
{"name":"Fill-In Orb","location":"Concealed Ruins, Marine Resort, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Fire Blast","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Fire Stone","location":"Labyrinth Cave"},
{"name":"Flamethrower","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Flash Cannon","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Flash","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Fling","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Fly","location":"Dojo: Last Maze, Destiny Tower, Spinda's Cafe (Silver, Gold Ticket)"},
{"name":"Focus Blast","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Focus Punch","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Foe-Fear Orb","location":"Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Foe-Hold Orb","location":"Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Shaymin Village (Station Passes, Sky Peak), Lake Afar, Dojo: Last Maze, Zero Isle East, Zero Isle West, Destiny Tower, Star Cave"},
{"name":"Foe-Seal Orb","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Freeze Veil","location":"Zero Isle North"},
{"name":"Friend Bow","location":"Dark Crater, Deep Dark Crater, Marine Resort, Mt. Mistral, Zero Isle North, Zero Isle East, Zero Isle Center"},
{"name":"Frozen Rock","location":"Labyrinth Cave"},
{"name":"Frustration","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Zero Isle East, Zero Isle West, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Gabite Scale","location":"Labyrinth Cave"},
{"name":"Geo Pebble","location":"Drenched Bluff, Mt. Bristle, Waterfall Cave, Side Path, Craggy Coast, Rock Path, Mt. Horn, Crystal Cave, Brine Cave, Lower Brine Cave, Labyrinth Cave, Blizzard Island, Mt. Travail, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Lake Afar, Happy Outlook, Mt. Mistral, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Giant Volcano, World Abyss"},
{"name":"Giga Drain","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Giga Impact","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Ginseng","location":"Mt. Mistral, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Star Cave"},
{"name":"Goggle Specs","location":"Zero Isle South"},
{"name":"Gold Gummi","location":"Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle West, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Shimmer Desert"},
{"name":"Gold Ribbon","location":"Amp Plains, Far Amp Plains, Labyrinth Cave, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Giant Volcano, World Abyss, Sky Stairway"},
{"name":"Gone Pebble","location":"Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Bottomless Sea, Shimmer Desert, Mt. Avalanche, Giant Volcano, World Abyss, Mystery Jungle"},
{"name":"Grass Cornet","location":"Mystery Jungle"},
{"name":"Grass Gummi","location":"Drenched Bluff, Mt. Bristle, Waterfall Cave, Apple Woods, Craggy Coast, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle West, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Grass Knot","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Gravelerock","location":"Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Shimmer Desert, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Gravelyrock","location":"Chasm Cave, Dark Hill, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Shimmer Desert, Sky Stairway"},
{"name":"Gray Gummi","location":"Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Lost Wilderness, Dojo: Last Maze, Zero Isle North, Zero Isle West, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Shimmer Desert"},
{"name":"Green Gummi","location":"Craggy Coast, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle West, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Shimmer Desert"},
{"name":"Grimy Food","location":"Northern Desert, Quicksand Cave, Quicksand Cave Pit, Mt. Mistral, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Shimmer Desert"},
{"name":"Gyro Ball","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Hail Orb","location":"Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Heal Ribbon","location":"Crystal Cave, Crystal Crossing, Chasm Cave, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Giant Volcano, World Abyss, Sky Stairway"},
{"name":"Heal Seed","location":"Drenched Bluff, Mt. Bristle, Waterfall Cave, Apple Woods, Craggy Coast, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Blizzard Island, Concealed Ruins, Lake Afar, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Giant Volcano, World Abyss, Sky Stairway"},
{"name":"Hidden Power","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Hope Robe","location":"Zero Isle East"},
{"name":"Huge Apple","location":"Shaymin Village (Station Passes, Sky Peak), Marine Resort, Zero Isle North, Star Cave"},
{"name":"Hunger Seed","location":"Amp Plains, Far Amp Plains, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Brine Cave, Lower Brine Cave, Labyrinth Cave, Shaymin Village (Station Passes, Sky Peak), Spacial Rift, Deep Spacial Rift, Lake Afar, Happy Outlook, Zero Isle North, Zero Isle East, Zero Isle West, Destiny Tower"},
{"name":"Hurl Orb","location":"Mt. Bristle, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Hyper Beam","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Ice Beam","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Icy Flute","location":"Mt. Avalanche"},
{"name":"Identify Orb","location":"Mystifying Forest, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Insomniscope","location":"Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Temporal Tower, Temporal Spire, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Giant Volcano, World Abyss, Sky Stairway"},
{"name":"Invisify Orb","location":"Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Labyrinth Cave, Shaymin Village (Station Passes, Sky Peak), Spacial Rift, Deep Spacial Rift, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Iron Tail","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Iron Thorn","location":"Mt. Horn, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Lake Afar, Happy Outlook, Mt. Mistral, Lost Wilderness, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Star Cave, Sky Stairway, Mystery Jungle"},
{"name":"Iron","location":"Shaymin Village (Station Passes, Sky Peak), Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Star Cave"},
{"name":"Itemizer Orb","location":"Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Joy Ribbon","location":"Crystal Cave, Crystal Crossing, Chasm Cave, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Bottomless Sea, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Joy Seed","location":"Shaymin Village (Station Passes, Sky Peak), Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Spinda's Cafe (Random special recycle offer)"},
{"name":"Key","location":"Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Zero Isle East, Zero Isle West, Zero Isle South"},
{"name":"King's Rock","location":"Labyrinth Cave"},
{"name":"Leaf Stone","location":"Labyrinth Cave"},
{"name":"Life Seed","location":"Labyrinth Cave, Shaymin Village (Station Passes, Sky Peak), Concealed Ruins, Lake Afar, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Light Screen","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Link Box","location":"Amp Plains, Far Amp Plains, Labyrinth Cave, Marine Resort, Lake Afar, Dojo: Last Maze, Destiny Tower, ★4+ Job Reward"},
{"name":"Link Cable","location":"Labyrinth Cave"},
{"name":"Lob Orb","location":"Amp Plains, Far Amp Plains, Crystal Cave, Labyrinth Cave, Mystifying Forest, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Lake Afar, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Lockon Specs","location":"Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower"},
{"name":"Longtoss Orb","location":"Labyrinth Cave, Mystifying Forest, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Lake Afar, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Lost Loot","location":"Star Cave"},
{"name":"Luminous Orb","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Magmarizer","location":"Labyrinth Cave"},
{"name":"Max Elixir","location":"Drenched Bluff, Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Oran Forest, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Mt. Travail, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Sky Stairway, Mystery Jungle"},
{"name":"Metal Coat","location":"Labyrinth Cave"},
{"name":"Mix Elixir","location":"Drenched Bluff, Mt. Bristle, Waterfall Cave, Apple Woods, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Mt. Travail, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Mobile Orb","location":"Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Mystifying Forest, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Mobile Scarf","location":"Dark Crater, Deep Dark Crater, Marine Resort"},
{"name":"Moon Stone","location":"Labyrinth Cave"},
{"name":"Mossy Rock","location":"Labyrinth Cave"},
{"name":"Mug Orb","location":"Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Concealed Ruins, Marine Resort, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Munch Belt","location":"Temporal Tower, Temporal Spire, Spacial Rift, Deep Spacial Rift, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave"},
{"name":"Natural Gift","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"No-Aim Scope","location":"Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave"},
{"name":"No-Stick Cap","location":"Mystifying Forest, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Happy Outlook, Mt. Mistral, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Bottomless Sea, Mystery Jungle"},
{"name":"One-Room Orb","location":"Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower"},
{"name":"One-Shot Orb","location":"Waterfall Cave, Amp Plains, Far Amp Plains, Crystal Cave, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Labyrinth Cave, Shaymin Village (Station Passes, Sky Peak), Concealed Ruins, Marine Resort, Lake Afar, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Oran Berry","location":"Beach Cave, Drenched Bluff, Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Marowak Dojo, Oran Forest, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Mt. Travail, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Orange Gummi","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Craggy Coast, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle West, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Shimmer Desert"},
{"name":"Oren Berry","location":"Drenched Bluff, Mt. Bristle, Waterfall Cave, Apple Woods, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Mt. Travail, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Oval Stone","location":"Labyrinth Cave"},
{"name":"Overheat","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Pass Scarf","location":"Labyrinth Cave, Mystifying Forest, Surrounded Sea, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Lost Wilderness, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower"},
{"name":"Patsy Band","location":"Dark Hill, Sealed Ruin, Deep Sealed Ruin, Deep Dusk Forest, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Dark Crater, Deep Dark Crater, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Lost Wilderness, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Giant Volcano, World Abyss, Sky Stairway"},
{"name":"Payback","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Pecha Berry","location":"Drenched Bluff, Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Mt. Travail, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Pecha Scarf","location":"Mt. Horn, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Giant Volcano, World Abyss, Sky Stairway"},
{"name":"Persim Band","location":"Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Lost Wilderness, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Petrify Orb","location":"Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Pierce Band","location":"Zero Isle South"},
{"name":"Pierce Orb","location":"Concealed Ruins, Marine Resort, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Pink Gummi","location":"Drenched Bluff, Waterfall Cave, Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle West, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Plain Ribbon","location":"Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower"},
{"name":"Plain Seed","location":"Concealed Ruins, Zero Isle North, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Pluck","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Poison Jab","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Pounce Orb","location":"Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Power Band","location":"Waterfall Cave, Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway"},
{"name":"Protect","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Protector","location":"Labyrinth Cave"},
{"name":"Protein","location":"Shaymin Village (Station Passes, Sky Peak), Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Star Cave"},
{"name":"Psych Up","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Psychic","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Pure Seed","location":"Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle South, Destiny Tower, Spinda's Cafe (Random special recycle offer)"},
{"name":"Purple Gummi","location":"Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle West, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Shimmer Desert"},
{"name":"Quick Orb","location":"Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Quick Seed","location":"Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Midnight Forest, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Racket Band","location":"Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Bottomless Sea, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Radar Orb","location":"Waterfall Cave, Apple Woods, Foggy Forest, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Rainy Orb","location":"Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Rawst Berry","location":"Mt. Bristle, Side Path, Rock Path, Forest Path, Amp Plains, Far Amp Plains, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Midnight Forest, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, Sky Stairway, Mystery Jungle"},
{"name":"Razor Claw","location":"Labyrinth Cave"},
{"name":"Razor Fang","location":"Labyrinth Cave"},
{"name":"Reaper Cloth","location":"Labyrinth Cave"},
{"name":"Rebound Orb","location":"Dark Hill, Sealed Ruin, Deep Sealed Ruin, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Recycle","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Red Gummi","location":"Drenched Bluff, Waterfall Cave, Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle West, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Reflect","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Rest","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Return","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Reviser Seed","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Mt. Travail, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Reviver Seed","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Craggy Coast, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Midnight Forest, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Sky Stairway, Mystery Jungle"},
{"name":"Roar","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Rock Climb","location":"Dojo: Last Maze, Destiny Tower, Spinda's Cafe (Silver, Gold Ticket)"},
{"name":"Rock Horn","location":"World Abyss"},
{"name":"Rock Polish","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Rock Slide","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Rock Smash","location":"Dojo: Last Maze, Destiny Tower, Spinda's Cafe (Silver, Gold Ticket)"},
{"name":"Rocky Orb","location":"Crystal Cave, Mystifying Forest, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Rollcall Orb","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle North, Zero Isle East, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Roost","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Royal Gummi","location":"Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle West, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Safeguard","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Sandy Orb","location":"Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Scanner Orb","location":"Waterfall Cave, Apple Woods, Foggy Forest, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Scope Lens","location":"Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Dark Crater, Deep Dark Crater, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Lost Wilderness, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Giant Volcano, World Abyss, Sky Stairway"},
{"name":"Secret Power","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"See-Trap Orb","location":"Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Shadow Ball","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Shadow Claw","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Shiny Stone","location":"Labyrinth Cave"},
{"name":"Shock Wave","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Shocker Orb","location":"Labyrinth Cave, Mystifying Forest, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Lake Afar, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Silence Orb","location":"Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Silver Gummi","location":"Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Lost Wilderness, Dojo: Last Maze, Zero Isle North, Zero Isle West, Destiny Tower, Star Cave"},
{"name":"Silver Spike","location":"Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Tiny Meadow, Labyrinth Cave, Mystifying Forest, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Lake Afar, Happy Outlook, Mt. Mistral, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Star Cave, Shimmer Desert, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Silver Wind","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Sitrus Berry","location":"Labyrinth Cave, Shaymin Village (Station Passes, Sky Peak), Concealed Ruins, Lake Afar, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Sizebust Orb","location":"Crystal Cave, Labyrinth Cave, Mystifying Forest, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Lake Afar, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Skill Swap","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Sky Gift","location":"Shaymin Village (Station Passes, Sky Peak)"},
{"name":"Sky Gummi","location":"Craggy Coast, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle West, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Sky Melodica","location":"Sky Stairway"},
{"name":"Sleep Seed","location":"Beach Cave, Drenched Bluff, Mt. Bristle, Waterfall Cave, Apple Woods, Craggy Coast, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Mt. Travail, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Sleep Talk","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Slip Seed","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Mt. Travail, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Slow Orb","location":"Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Sludge Bomb","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Slumber Orb","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Snatch Orb","location":"Labyrinth Cave, Mystifying Forest, Concealed Ruins, Marine Resort, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Sneak Scarf","location":"Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Happy Outlook, Mt. Mistral, Zero Isle West, Zero Isle Center, Destiny Tower, Bottomless Sea, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"SolarBeam","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Special Band","location":"Waterfall Cave, Apple Woods, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Mystery Jungle"},
{"name":"Spurn Orb","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Shaymin Village (Station Passes, Sky Peak), Lake Afar, Dojo: Last Maze, Zero Isle East, Zero Isle West, Destiny Tower, Star Cave"},
{"name":"Stairs Orb","location":"Mystifying Forest, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Stamina Band","location":"Mt. Horn, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Giant Volcano, World Abyss, Sky Stairway"},
{"name":"Stayaway Orb","location":"Crystal Cave, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Lake Afar, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Stealth Rock","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Steel Wing","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Stick","location":"Mt. Bristle, Apple Woods, Foggy Forest, Deep Dusk Forest, Serenity River, Mystifying Forest, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Happy Outlook, Mt. Mistral, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Star Cave, Sky Stairway, Mystery Jungle"},
{"name":"Stone Edge","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Strength","location":"Dojo: Last Maze, Destiny Tower, Spinda's Cafe (Silver, Gold Ticket)"},
{"name":"Stun Seed","location":"Drenched Bluff, Mt. Bristle, Waterfall Cave, Apple Woods, Craggy Coast, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Blizzard Island, Concealed Ruins, Lake Afar, Happy Outlook, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Substitute","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Sun Stone","location":"Labyrinth Cave"},
{"name":"Sunny Orb","location":"Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Surf","location":"Dojo: Last Maze, Destiny Tower, Spinda's Cafe (Silver, Gold Ticket)"},
{"name":"Swagger","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Switcher Orb","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Swords Dance","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Taunt","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Terra Cymbal","location":"Shimmer Desert"},
{"name":"Thief","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Thunder Wave","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Thunder","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Thunderbolt","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Thunderstone","location":"Labyrinth Cave"},
{"name":"Tight Belt","location":"Zero Isle South"},
{"name":"Torment","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Totter Orb","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Totter Seed","location":"Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Giant Volcano, Sky Stairway, Mystery Jungle"},
{"name":"Toxic","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Transfer Orb","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Trap Scarf","location":"Zero Isle South"},
{"name":"Trapbust Orb","location":"Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Trapper Orb","location":"Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Trawl Orb","location":"Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Trick Room","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Twist Band","location":"Waterfall Cave, Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Two-Edge Orb","location":"Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower"},
{"name":"U-turn","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Upgrade","location":"Labyrinth Cave"},
{"name":"Vacuum-Cut","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Vanish Seed","location":"Zero Isle East, Zero Isle West, Destiny Tower"},
{"name":"Via Seed","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Mt. Travail, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Vile Seed","location":"Amp Plains, Far Amp Plains, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Labyrinth Cave, Concealed Ruins, Lake Afar, Zero Isle North, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Violent Seed","location":"Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Concealed Ruins, Lake Afar, Mt. Mistral, Midnight Forest, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Wander Gummi","location":"Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Bottomless Sea, Shimmer Desert, Mt. Avalanche, Giant Volcano, World Abyss, Mystery Jungle"},
{"name":"Warp Orb","location":"Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Northern Desert, Quicksand Cave, Quicksand Cave Pit, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Tiny Meadow, Lush Prairie, Serenity River, Landslide Cave, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, World Abyss, Sky Stairway, Mystery Jungle"},
{"name":"Warp Scarf","location":"Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Blizzard Island, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Midnight Forest, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Giant Volcano, World Abyss, Sky Stairway"},
{"name":"Warp Seed","location":"Drenched Bluff, Mt. Bristle, Waterfall Cave, Apple Woods, Craggy Coast, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Mt. Travail, The Nightmare, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Sky Stairway, Mystery Jungle"},
{"name":"Water Pulse","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Water Stone","location":"Labyrinth Cave"},
{"name":"Waterfall","location":"Dojo: Last Maze, Destiny Tower, Spinda's Cafe (Silver, Gold Ticket)"},
{"name":"Weather Band","location":"Labyrinth Cave, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower"},
{"name":"Whiff Specs","location":"Zero Isle West, Zero Isle South, Destiny Tower"},
{"name":"White Gummi","location":"Drenched Bluff, Mt. Bristle, Waterfall Cave, Apple Woods, Craggy Coast, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle West, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"Wide Slash","location":"Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Will-O-Wisp","location":"Labyrinth Cave, Concealed Ruins, Lake Afar, Dojo: Last Maze, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave"},
{"name":"X-Eye Seed","location":"Drenched Bluff, Mt. Bristle, Waterfall Cave, Apple Woods, Side Path, Craggy Coast, Rock Path, Mt. Horn, Forest Path, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Mystifying Forest, Blizzard Island, Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Mt. Travail, The Nightmare, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Marine Resort, Happy Outlook, Dojo: Last Maze, Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Giant Volcano, Sky Stairway, Mystery Jungle"},
{"name":"X-Ray Specs","location":"Zero Isle East, Zero Isle West, Destiny Tower"},
{"name":"X-Scissor","location":"Labyrinth Cave, Mystifying Forest, Blizzard Island, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Concealed Ruins, Lake Afar, Happy Outlook, Shimmer Hill, Lost Wilderness, Midnight Forest, Dojo: Last Maze, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mystery Jungle"},
{"name":"Yellow Gummi","location":"Drenched Bluff, Waterfall Cave, Apple Woods, Mt. Horn, Foggy Forest, Steam Cave, Upper Steam Cave, Amp Plains, Far Amp Plains, Crystal Cave, Crystal Crossing, Treeshroud Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Aegis Cave (Ice/Rock/Steel), Aegis Cave Pit, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Marine Resort, Happy Outlook, Mt. Mistral, Dojo: Last Maze, Zero Isle North, Zero Isle West, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Shimmer Desert"},
{"name":"Zinc Band","location":"Crystal Cave, Crystal Crossing, Chasm Cave, Dark Hill, Sealed Ruin, Deep Sealed Ruin, Dusk Forest, Deep Dusk Forest, Brine Cave, Lower Brine Cave, Hidden Land, Hidden Highland, Temporal Tower, Temporal Spire, Labyrinth Cave, Mystifying Forest, Shaymin Village (Station Passes, Sky Peak), Crevice Cave, Lower Crevice Cave, Surrounded Sea, Miracle Sea, Deep Miracle Sea, Spacial Rift, Deep Spacial Rift, Dark Crater, Deep Dark Crater, Concealed Ruins, Marine Resort, Lake Afar, Happy Outlook, Mt. Mistral, Lost Wilderness, Zero Isle East, Zero Isle West, Zero Isle South, Zero Isle Center, Destiny Tower, Oblivion Forest, Treacherous Waters, Southeastern Islands, Inferno Cave, Star Cave, Bottomless Sea, Mt. Avalanche, Mystery Jungle"},
{"name":"Zinc","location":"Shaymin Village (Station Passes, Sky Peak), Zero Isle North, Zero Isle East, Zero Isle West, Zero Isle South, Destiny Tower, Star Cave"}
]
